#GroupBy and Aggregations

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv(r"C:\Users\Vignesh R\Downloads\customers_order.csv")

In [3]:
data.head(10)

,customer_id,customer_name,email,city,state,order_id,purchase_date,item_id,item_name,quantity,price_each,order_total,payment_method
0,2,Riya Sharma,riya@gmail.com,Bangalore,Karnataka,10000,2024-05-05,101,Wireless Mouse,3,599,1797,Credit Card
1,3,Arjun Patel,arjun@gmail.com,Ahmedabad,Gujarat,10001,2024-02-14,102,Keyboard,5,999,4995,Cash on Delivery
2,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10002,2024-02-17,101,Wireless Mouse,1,599,599,Credit Card
3,4,Neha Verma,neha@gmail.com,Delhi,Delhi,10003,2024-04-11,101,Wireless Mouse,5,599,2995,Cash on Delivery
4,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10004,2024-10-28,104,Headphones,4,1499,5996,Debit Card
5,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10005,2024-06-23,103,USB Cable,4,199,796,Debit Card
6,3,Arjun Patel,arjun@gmail.com,Ahmedabad,Gujarat,10006,2024-02-22,104,Headphones,3,1499,4497,UPI
7,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10007,2024-06-25,102,Keyboard,3,999,2997,Cash on Delivery
8,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10008,2024-10-01,101,Wireless Mouse,4,599,2396,UPI
9,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10009,2024-05-30,102,Keyboard,5,999,4995,Cash on Delivery

In [4]:
data.columns

Index(['customer_id', 'customer_name', 'email', 'city', 'state', 'order_id',
       'purchase_date', 'item_id', 'item_name', 'quantity', 'price_each',
       'order_total', 'payment_method'],
      dtype='object')

In [5]:
#GroupBy
# the groupby is were easily combine the unique value and arrange in particular order 
# which will helps with aggregation - aggregate function  = mean, sum, average, median...

data.groupby(['customer_name'])

In [6]:
data['customer_name'].unique()

array(['Riya Sharma', 'Arjun Patel', 'Rahul Das', 'Neha Verma',
       'Aarav Kumar', 'Vikram Singh', 'Priya Nair', 'Sneha Joshi',
       'Karthik R', 'Ananya Iyer'], dtype=object)

In [7]:
#data[CONDITION]

data[data['customer_name'] == 'Rahul Das'].head()

,customer_id,customer_name,email,city,state,order_id,purchase_date,item_id,item_name,quantity,price_each,order_total,payment_method
2,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10002,2024-02-17,101,Wireless Mouse,1,599,599,Credit Card
4,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10004,2024-10-28,104,Headphones,4,1499,5996,Debit Card
7,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10007,2024-06-25,102,Keyboard,3,999,2997,Cash on Delivery
9,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10009,2024-05-30,102,Keyboard,5,999,4995,Cash on Delivery
20,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10020,2024-03-11,106,Webcam,2,1899,3798,Cash on Delivery

In [8]:
data[data['customer_name'] == 'Neha Verma'].head() # trail this (summa pani pathe)

,customer_id,customer_name,email,city,state,order_id,purchase_date,item_id,item_name,quantity,price_each,order_total,payment_method
3,4,Neha Verma,neha@gmail.com,Delhi,Delhi,10003,2024-04-11,101,Wireless Mouse,5,599,2995,Cash on Delivery
17,4,Neha Verma,neha@gmail.com,Delhi,Delhi,10017,2024-09-12,106,Webcam,2,1899,3798,Net Banking
34,4,Neha Verma,neha@gmail.com,Delhi,Delhi,10034,2024-07-23,104,Headphones,3,1499,4497,Debit Card
37,4,Neha Verma,neha@gmail.com,Delhi,Delhi,10037,2024-02-06,104,Headphones,1,1499,1499,UPI
38,4,Neha Verma,neha@gmail.com,Delhi,Delhi,10038,2024-06-18,102,Keyboard,1,999,999,UPI

In [9]:
data[data['customer_name'] == 'Neha Verma'][['customer_id','order_total']]

     customer_id  order_total
3              4         2995
17             4         3798
34             4         4497
37             4         1499
38             4          999
41             4         8796
52             4         2598
57             4         2995
59             4         5196
63             4         5697
94             4         4398
96             4         2998
97             4        10995
99             4          199
100            4          995
105            4         5196
106            4         3897
113            4         4398
145            4         1998
148            4         3798
156            4         4995
160            4         1299
165            4          597
186            4        10995
187            4          199
204            4        12495
206            4        10995
215            4         7495
229            4          796
233            4         1899
263            4        12495
268            4         9996
277            4          597
287            4         3798
289            4         1998

In [10]:
data.groupby(['customer_id']).agg(              # this aggregation funtion will helps to calculate the mean, sum, average, median..., like this were helpfull
    {'order_total':'sum'}                            # the syntax is = agg({"column_name":"aggregate_funtion"}) using with the ( groupby )
)                                                # tha main matter is when we use the groupby function for the particular column that will default give the result in the index name...this were doing by the pandas dataframe ...

             order_total
customer_id
1                 131508
2                 141403
3                 157705
4                 158591
5                 131917
6                 120227
7                 132712
8                 154293
9                 108914
10                116427

In [38]:
temp = data.groupby(['customer_id']).agg(              # this aggregation funtion will helps to calculate the mean, sum, average, median..., like this were helpfull
    {'order_total':'sum'}                            # the syntax is = agg({"column_name":"aggregate_funtion"}) using with the ( groupby )
)                                              # tha main matter is when we use the groupby function for the particular column that will default give the result in the index name...this were doing by the pandas dataframe ...

In [39]:
temp.columns

Index(['order_total'], dtype='object')

In [40]:
temp.index

Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], dtype='int64', name='customer_id')

In [41]:
temp = temp.reset_index() # this funtion will helps to reset the index name back into normal

In [42]:
temp

   customer_id  order_total
0            1       131508
1            2       141403
2            3       157705
3            4       158591
4            5       131917
5            6       120227
6            7       132712
7            8       154293
8            9       108914
9           10       116427

In [43]:
data.head(5)

,customer_id,customer_name,email,city,state,order_id,purchase_date,item_id,item_name,quantity,price_each,order_total,payment_method,month,year
0,2,Riya Sharma,riya@gmail.com,Bangalore,Karnataka,10000,2024-05-05,101,Wireless Mouse,3,599,1797,Credit Card,5,2024
1,3,Arjun Patel,arjun@gmail.com,Ahmedabad,Gujarat,10001,2024-02-14,102,Keyboard,5,999,4995,Cash on Delivery,2,2024
2,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10002,2024-02-17,101,Wireless Mouse,1,599,599,Credit Card,2,2024
3,4,Neha Verma,neha@gmail.com,Delhi,Delhi,10003,2024-04-11,101,Wireless Mouse,5,599,2995,Cash on Delivery,4,2024
4,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10004,2024-10-28,104,Headphones,4,1499,5996,Debit Card,10,2024

In [44]:
data[['purchase_date','order_total']]

    purchase_date  order_total
0      2024-05-05         1797
1      2024-02-14         4995
2      2024-02-17          599
3      2024-04-11         2995
4      2024-10-28         5996
..            ...          ...
295    2024-01-30         2199
296    2024-11-10          999
297    2024-10-24         9996
298    2024-04-06        10995
299    2024-03-18        10995

[300 rows x 2 columns]

In [45]:
data['month'] = pd.to_datetime(data['purchase_date']).dt.month # i change the purchase date column into date time type format for extract the month from the purchase_date
                                                               # because that purchase_date column in the string type 
data['year'] = pd.to_datetime(data['purchase_date']).dt.year

In [46]:
data.head()

,customer_id,customer_name,email,city,state,order_id,purchase_date,item_id,item_name,quantity,price_each,order_total,payment_method,month,year
0,2,Riya Sharma,riya@gmail.com,Bangalore,Karnataka,10000,2024-05-05,101,Wireless Mouse,3,599,1797,Credit Card,5,2024
1,3,Arjun Patel,arjun@gmail.com,Ahmedabad,Gujarat,10001,2024-02-14,102,Keyboard,5,999,4995,Cash on Delivery,2,2024
2,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10002,2024-02-17,101,Wireless Mouse,1,599,599,Credit Card,2,2024
3,4,Neha Verma,neha@gmail.com,Delhi,Delhi,10003,2024-04-11,101,Wireless Mouse,5,599,2995,Cash on Delivery,4,2024
4,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10004,2024-10-28,104,Headphones,4,1499,5996,Debit Card,10,2024

In [47]:
data[['month','order_total']]

     month  order_total
0        5         1797
1        2         4995
2        2          599
3        4         2995
4       10         5996
..     ...          ...
295      1         2199
296     11          999
297     10         9996
298      4        10995
299      3        10995

[300 rows x 2 columns]

In [48]:
data[['month']]

     month
0        5
1        2
2        2
3        4
4       10
..     ...
295      1
296     11
297     10
298      4
299      3

[300 rows x 1 columns]

In [49]:
f = data.groupby(['customer_id','month']).agg(
    {'order_total':'sum'}
)

In [50]:
f = f.reset_index()

In [51]:
f.head(10)

   customer_id  month  order_total
0            1      1        16392
1            1      2        16689
2            1      4        21187
3            1      5        15887
4            1      6         5992
5            1      7          597
6            1      8        31581
7            1     10        17987
8            1     11         5196
9            2      2         1198

In [52]:
a = data.groupby(['customer_id','month'])[['customer_id','month','order_total']].agg(
    {'order_total':'sum'}
).reset_index()

In [53]:
a

     customer_id  month  order_total
0              1      1        16392
1              1      2        16689
2              1      4        21187
3              1      5        15887
4              1      6         5992
..           ...    ...          ...
96            10      7        26887
97            10      8        20790
98            10      9        11994
99            10     10         6092
100           10     11         9095

[101 rows x 3 columns]

In [54]:
data.groupby(['year','month'])[['year','month','order_total']].agg(
    {'order_total':'mean'}
).reset_index()

    year  month  order_total
0   2024      1  4457.080000
1   2024      2  4392.380952
2   2024      3  4582.148148
3   2024      4  4708.185185
4   2024      5  3507.607143
5   2024      6  4000.785714
6   2024      7  4497.272727
7   2024      8  4542.714286
8   2024      9  5936.550000
9   2024     10  4131.379310
10  2024     11  5896.470588

In [55]:
# top three city with revenue

In [56]:
df_city_revenue = data.groupby(['city'])[['city','order_total']].agg(
    {'order_total':'sum'}
).reset_index()

In [57]:
df_city_revenue

         city  order_total
0   Ahmedabad       157705
1   Bangalore       141403
2     Chennai       131508
3  Coimbatore       108914
4       Delhi       158591
5      Jaipur       131917
6       Kochi       120227
7     Kolkata       132712
8     Madurai       116427
9        Pune       154293

In [58]:
df_city_revenue['rank_col'] = df_city_revenue['order_total'].rank(method='dense',ascending= False)

In [59]:
df_city_revenue

         city  order_total  rank_col
0   Ahmedabad       157705       2.0
1   Bangalore       141403       4.0
2     Chennai       131508       7.0
3  Coimbatore       108914      10.0
4       Delhi       158591       1.0
5      Jaipur       131917       6.0
6       Kochi       120227       8.0
7     Kolkata       132712       5.0
8     Madurai       116427       9.0
9        Pune       154293       3.0

In [60]:
df_city_revenue[df_city_revenue['rank_col']<=3]

        city  order_total  rank_col
0  Ahmedabad       157705       2.0
4      Delhi       158591       1.0
9       Pune       154293       3.0

In [61]:
# which customer has a high streak for ordering the products

In [62]:
data['customer_name'].unique()

array(['Riya Sharma', 'Arjun Patel', 'Rahul Das', 'Neha Verma',
       'Aarav Kumar', 'Vikram Singh', 'Priya Nair', 'Sneha Joshi',
       'Karthik R', 'Ananya Iyer'], dtype=object)

In [63]:
data

,customer_id,customer_name,email,city,state,order_id,purchase_date,item_id,item_name,quantity,price_each,order_total,payment_method,month,year
0,2,Riya Sharma,riya@gmail.com,Bangalore,Karnataka,10000,2024-05-05,101,Wireless Mouse,3,599,1797,Credit Card,5,2024
1,3,Arjun Patel,arjun@gmail.com,Ahmedabad,Gujarat,10001,2024-02-14,102,Keyboard,5,999,4995,Cash on Delivery,2,2024
2,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10002,2024-02-17,101,Wireless Mouse,1,599,599,Credit Card,2,2024
3,4,Neha Verma,neha@gmail.com,Delhi,Delhi,10003,2024-04-11,101,Wireless Mouse,5,599,2995,Cash on Delivery,4,2024
4,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10004,2024-10-28,104,Headphones,4,1499,5996,Debit Card,10,2024
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
295,8,Sneha Joshi,sneha@gmail.com,Pune,Maharashtra,10295,2024-01-30,108,Power Bank,1,2199,2199,Debit Card,1,2024
296,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10296,2024-11-10,102,Keyboard,1,999,999,Cash on Delivery,11,2024
297,9,Karthik R,karthik@gmail.com,Coimbatore,Tamil Nadu,10297,2024-10-24,107,Bluetooth Speaker,4,2499,9996,Cash on Delivery,10,2024
298,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10298,2024-04-06,108,Power Bank,5,2199,10995,Debit Card,4,2024
299,10,Ananya Iyer,ananya@gmail.com,Madurai,Tamil Nadu,10299,2024-03-18,108,Power Bank,5,2199,10995,UPI,3,2024

In [64]:
data[['customer_name','customer_id','customer_name','purchase_date','item_id']].head()

  customer_name  customer_id customer_name purchase_date  item_id
0   Riya Sharma            2   Riya Sharma    2024-05-05      101
1   Arjun Patel            3   Arjun Patel    2024-02-14      102
2     Rahul Das            7     Rahul Das    2024-02-17      101
3    Neha Verma            4    Neha Verma    2024-04-11      101
4     Rahul Das            7     Rahul Das    2024-10-28      104

In [65]:
data.groupby(['customer_name']).agg(
    {'purchase_date':'count'}
).reset_index()

  customer_name  purchase_date
0   Aarav Kumar             26
1   Ananya Iyer             28
2   Arjun Patel             30
3     Karthik R             30
4    Neha Verma             35
5    Priya Nair             24
6     Rahul Das             31
7   Riya Sharma             31
8   Sneha Joshi             35
9  Vikram Singh             30

In [66]:
data['day'] = pd.to_datetime(data['purchase_date']).dt.day

In [67]:
data

,customer_id,customer_name,email,city,state,order_id,purchase_date,item_id,item_name,quantity,price_each,order_total,payment_method,month,year,day
0,2,Riya Sharma,riya@gmail.com,Bangalore,Karnataka,10000,2024-05-05,101,Wireless Mouse,3,599,1797,Credit Card,5,2024,5
1,3,Arjun Patel,arjun@gmail.com,Ahmedabad,Gujarat,10001,2024-02-14,102,Keyboard,5,999,4995,Cash on Delivery,2,2024,14
2,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10002,2024-02-17,101,Wireless Mouse,1,599,599,Credit Card,2,2024,17
3,4,Neha Verma,neha@gmail.com,Delhi,Delhi,10003,2024-04-11,101,Wireless Mouse,5,599,2995,Cash on Delivery,4,2024,11
4,7,Rahul Das,rahul@gmail.com,Kolkata,West Bengal,10004,2024-10-28,104,Headphones,4,1499,5996,Debit Card,10,2024,28
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
295,8,Sneha Joshi,sneha@gmail.com,Pune,Maharashtra,10295,2024-01-30,108,Power Bank,1,2199,2199,Debit Card,1,2024,30
296,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10296,2024-11-10,102,Keyboard,1,999,999,Cash on Delivery,11,2024,10
297,9,Karthik R,karthik@gmail.com,Coimbatore,Tamil Nadu,10297,2024-10-24,107,Bluetooth Speaker,4,2499,9996,Cash on Delivery,10,2024,24
298,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10298,2024-04-06,108,Power Bank,5,2199,10995,Debit Card,4,2024,6
299,10,Ananya Iyer,ananya@gmail.com,Madurai,Tamil Nadu,10299,2024-03-18,108,Power Bank,5,2199,10995,UPI,3,2024,18

In [68]:
data.groupby(['customer_name','day']).agg(
    {'purchase_date':'count'}
).reset_index()

    customer_name  day  purchase_date
0     Aarav Kumar    1              1
1     Aarav Kumar    3              1
2     Aarav Kumar    4              1
3     Aarav Kumar    5              1
4     Aarav Kumar    6              2
..            ...  ...            ...
189  Vikram Singh   25              2
190  Vikram Singh   26              1
191  Vikram Singh   27              1
192  Vikram Singh   28              2
193  Vikram Singh   29              1

[194 rows x 3 columns]

In [69]:
df = data.sort_values(['customer_name','day'])

In [70]:
df

,customer_id,customer_name,email,city,state,order_id,purchase_date,item_id,item_name,quantity,price_each,order_total,payment_method,month,year,day
26,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10026,2024-04-01,105,Laptop Stand,5,1299,6495,Cash on Delivery,4,2024,1
139,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10139,2024-05-03,104,Headphones,1,1499,1499,Net Banking,5,2024,3
236,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10236,2024-05-04,101,Wireless Mouse,3,599,1797,Credit Card,5,2024,4
55,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10055,2024-02-05,102,Keyboard,2,999,1998,Cash on Delivery,2,2024,5
247,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10247,2024-08-06,108,Power Bank,4,2199,8796,UPI,8,2024,6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
213,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10213,2024-01-26,101,Wireless Mouse,5,599,2995,Cash on Delivery,1,2024,26
167,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10167,2024-08-27,108,Power Bank,1,2199,2199,Debit Card,8,2024,27
164,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10164,2024-02-28,104,Headphones,4,1499,5996,Cash on Delivery,2,2024,28
273,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10273,2024-02-28,104,Headphones,5,1499,7495,Debit Card,2,2024,28
15,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10015,2024-01-29,104,Headphones,3,1499,4497,Credit Card,1,2024,29

In [71]:
df['day_diff'] = df.groupby(['customer_name'])['day'].diff()

In [72]:
df

,customer_id,customer_name,email,city,state,order_id,purchase_date,item_id,item_name,quantity,price_each,order_total,payment_method,month,year,day,day_diff
26,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10026,2024-04-01,105,Laptop Stand,5,1299,6495,Cash on Delivery,4,2024,1,NaN
139,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10139,2024-05-03,104,Headphones,1,1499,1499,Net Banking,5,2024,3,2.0
236,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10236,2024-05-04,101,Wireless Mouse,3,599,1797,Credit Card,5,2024,4,1.0
55,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10055,2024-02-05,102,Keyboard,2,999,1998,Cash on Delivery,2,2024,5,1.0
247,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10247,2024-08-06,108,Power Bank,4,2199,8796,UPI,8,2024,6,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
213,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10213,2024-01-26,101,Wireless Mouse,5,599,2995,Cash on Delivery,1,2024,26,1.0
167,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10167,2024-08-27,108,Power Bank,1,2199,2199,Debit Card,8,2024,27,1.0
164,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10164,2024-02-28,104,Headphones,4,1499,5996,Cash on Delivery,2,2024,28,1.0
273,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10273,2024-02-28,104,Headphones,5,1499,7495,Debit Card,2,2024,28,0.0
15,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10015,2024-01-29,104,Headphones,3,1499,4497,Credit Card,1,2024,29,1.0

In [73]:
df['streak_id'] = (df['day_diff'] != 1).cumsum()

In [74]:
df

,customer_id,customer_name,email,city,state,order_id,purchase_date,item_id,item_name,quantity,price_each,order_total,payment_method,month,year,day,day_diff,streak_id
26,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10026,2024-04-01,105,Laptop Stand,5,1299,6495,Cash on Delivery,4,2024,1,NaN,1
139,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10139,2024-05-03,104,Headphones,1,1499,1499,Net Banking,5,2024,3,2.0,2
236,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10236,2024-05-04,101,Wireless Mouse,3,599,1797,Credit Card,5,2024,4,1.0,2
55,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10055,2024-02-05,102,Keyboard,2,999,1998,Cash on Delivery,2,2024,5,1.0,2
247,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10247,2024-08-06,108,Power Bank,4,2199,8796,UPI,8,2024,6,1.0,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
213,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10213,2024-01-26,101,Wireless Mouse,5,599,2995,Cash on Delivery,1,2024,26,1.0,176
167,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10167,2024-08-27,108,Power Bank,1,2199,2199,Debit Card,8,2024,27,1.0,176
164,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10164,2024-02-28,104,Headphones,4,1499,5996,Cash on Delivery,2,2024,28,1.0,176
273,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10273,2024-02-28,104,Headphones,5,1499,7495,Debit Card,2,2024,28,0.0,177
15,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10015,2024-01-29,104,Headphones,3,1499,4497,Credit Card,1,2024,29,1.0,177

In [75]:
 df['streak_length'] = df.groupby(['customer_name','streak_id'])[['day']].transform('count')

In [76]:
df

,customer_id,customer_name,email,city,state,order_id,purchase_date,item_id,item_name,quantity,price_each,order_total,payment_method,month,year,day,day_diff,streak_id,streak_length
26,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10026,2024-04-01,105,Laptop Stand,5,1299,6495,Cash on Delivery,4,2024,1,NaN,1,1
139,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10139,2024-05-03,104,Headphones,1,1499,1499,Net Banking,5,2024,3,2.0,2,4
236,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10236,2024-05-04,101,Wireless Mouse,3,599,1797,Credit Card,5,2024,4,1.0,2,4
55,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10055,2024-02-05,102,Keyboard,2,999,1998,Cash on Delivery,2,2024,5,1.0,2,4
247,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10247,2024-08-06,108,Power Bank,4,2199,8796,UPI,8,2024,6,1.0,2,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
213,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10213,2024-01-26,101,Wireless Mouse,5,599,2995,Cash on Delivery,1,2024,26,1.0,176,4
167,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10167,2024-08-27,108,Power Bank,1,2199,2199,Debit Card,8,2024,27,1.0,176,4
164,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10164,2024-02-28,104,Headphones,4,1499,5996,Cash on Delivery,2,2024,28,1.0,176,4
273,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10273,2024-02-28,104,Headphones,5,1499,7495,Debit Card,2,2024,28,0.0,177,2
15,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10015,2024-01-29,104,Headphones,3,1499,4497,Credit Card,1,2024,29,1.0,177,2

In [77]:
max_streak = (
    df.groupby(['customer_name','streak_id']).size().groupby('customer_name').max().reset_index(name='max_streak')
)

In [78]:
max_streak

  customer_name  max_streak
0   Aarav Kumar           4
1   Ananya Iyer           5
2   Arjun Patel           3
3     Karthik R           4
4    Neha Verma           3
5    Priya Nair           3
6     Rahul Das           3
7   Riya Sharma           4
8   Sneha Joshi           4
9  Vikram Singh           4

In [79]:
max_streak['rank'] = max_streak['max_streak'].rank(
    method='dense',
    ascending=False
)

In [80]:
max_streak

  customer_name  max_streak  rank
0   Aarav Kumar           4   2.0
1   Ananya Iyer           5   1.0
2   Arjun Patel           3   3.0
3     Karthik R           4   2.0
4    Neha Verma           3   3.0
5    Priya Nair           3   3.0
6     Rahul Das           3   3.0
7   Riya Sharma           4   2.0
8   Sneha Joshi           4   2.0
9  Vikram Singh           4   2.0

In [81]:
df

,customer_id,customer_name,email,city,state,order_id,purchase_date,item_id,item_name,quantity,price_each,order_total,payment_method,month,year,day,day_diff,streak_id,streak_length
26,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10026,2024-04-01,105,Laptop Stand,5,1299,6495,Cash on Delivery,4,2024,1,NaN,1,1
139,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10139,2024-05-03,104,Headphones,1,1499,1499,Net Banking,5,2024,3,2.0,2,4
236,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10236,2024-05-04,101,Wireless Mouse,3,599,1797,Credit Card,5,2024,4,1.0,2,4
55,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10055,2024-02-05,102,Keyboard,2,999,1998,Cash on Delivery,2,2024,5,1.0,2,4
247,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10247,2024-08-06,108,Power Bank,4,2199,8796,UPI,8,2024,6,1.0,2,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
213,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10213,2024-01-26,101,Wireless Mouse,5,599,2995,Cash on Delivery,1,2024,26,1.0,176,4
167,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10167,2024-08-27,108,Power Bank,1,2199,2199,Debit Card,8,2024,27,1.0,176,4
164,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10164,2024-02-28,104,Headphones,4,1499,5996,Cash on Delivery,2,2024,28,1.0,176,4
273,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10273,2024-02-28,104,Headphones,5,1499,7495,Debit Card,2,2024,28,0.0,177,2
15,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10015,2024-01-29,104,Headphones,3,1499,4497,Credit Card,1,2024,29,1.0,177,2

In [82]:
data = df

In [83]:
data

,customer_id,customer_name,email,city,state,order_id,purchase_date,item_id,item_name,quantity,price_each,order_total,payment_method,month,year,day,day_diff,streak_id,streak_length
26,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10026,2024-04-01,105,Laptop Stand,5,1299,6495,Cash on Delivery,4,2024,1,NaN,1,1
139,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10139,2024-05-03,104,Headphones,1,1499,1499,Net Banking,5,2024,3,2.0,2,4
236,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10236,2024-05-04,101,Wireless Mouse,3,599,1797,Credit Card,5,2024,4,1.0,2,4
55,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10055,2024-02-05,102,Keyboard,2,999,1998,Cash on Delivery,2,2024,5,1.0,2,4
247,1,Aarav Kumar,aarav@gmail.com,Chennai,Tamil Nadu,10247,2024-08-06,108,Power Bank,4,2199,8796,UPI,8,2024,6,1.0,2,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
213,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10213,2024-01-26,101,Wireless Mouse,5,599,2995,Cash on Delivery,1,2024,26,1.0,176,4
167,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10167,2024-08-27,108,Power Bank,1,2199,2199,Debit Card,8,2024,27,1.0,176,4
164,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10164,2024-02-28,104,Headphones,4,1499,5996,Cash on Delivery,2,2024,28,1.0,176,4
273,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10273,2024-02-28,104,Headphones,5,1499,7495,Debit Card,2,2024,28,0.0,177,2
15,5,Vikram Singh,vikram@gmail.com,Jaipur,Rajasthan,10015,2024-01-29,104,Headphones,3,1499,4497,Credit Card,1,2024,29,1.0,177,2